tests/pure_openfoam_cases/phill/sim_lam/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    ( 0.0 0.0 0.0)
    ( 0.5 0.0 0.0)
    ( 1.5 0.0 0.0)
    ( 6 0.0 0.0)
    ( 6 0.0 0.05)
    ( 1.5 0.0 0.05)
    ( 0.5 0.0 0.05)
    ( 0.0 0.0 0.05)
    ( 0.0 1 0.0)
    ( 0.5 1 0.0)
    ( 1.5 1 0.0)
    ( 6 1 0.0)
    ( 6 1 0.05)
    ( 1.5 1 0.05)
    ( 0.5 1 0.05)
    ( 0.0 1 0.05)
);

blocks
(
    hex (0 1 9 8 7 6 14 15) (50 100 1) simpleGrading (1 ((0.1 0.25 41.9) (0.9 0.75 1)) 1)
    hex (1 2 10 9 6 5 13 14) (50 100 1) simpleGrading (1 ((0.1 0.25 41.9) (0.9 0.75 1)) 1)
    hex (2 3 11 10 5 4 12 13) (225 100 1) simpleGrading (1 ((0.1 0.25 41.9) (0.9 0.75 1)) 1)
);

edges
(
    spline 1 2 ((0.6 0.0124 0.0) (0.7 0.0395 0.0) (0.8 0.0724 0.0) (0.9 0.132 0.0) (1 0.172 0.0) (1.1 0.132 0.0) (1.2 0.0724 0.0) (1.3 0.0395 0.0) (1.4 0.0124 0.0))
    spline 6 5 ((0.6 0.0124 0.05) (0.7 0.0395 0.05) (0.8 0.0724 0.05) (0.9 0.132 0.05) (1 0.172 0.05) (1.1 0.132 0.05) (1.2 0.0724 0.05) (1.3 0.0395 0.05) (1.4 0.0124 0.05))
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (8 15 14 9)
            (9 14 13 10)
            (10 13 12 11)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 6 7)
            (1 2 5 6)
            (2 3 4 5)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (3 11 12 4)
        );
    }

    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 7 15 8)
        );
    }

    frontandbackplanes
    {
        type empty;
        faces
        (
            (0 8 9 1)
	        (1 9 10 2)
 	        (2 10 11 3)
	        (7 6 14 15)
            (6 5 13 14)
	        (5 4 12 13)
        );
    }
);
