tests/pure_openfoam_cases/phill/sim_lam/0/rhok
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rhok;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.15;

boundaryField
{
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    frontandbackplanes
    {
        type            empty;
    }

    outlet
    {
        type            cyclic;
    }

    inlet
    {
        type            cyclic;
    }

    mountaintop
    {
        type            zeroGradient;
    }

    mountainsides
    {
        type            zeroGradient;
    }
}
